{
    "author": "উস্তাদ আলী হাম্মুদা, মোহাম্মাদ ফারিস",
    "editor": "মুওয়াহহিদ মুহাম্মাদ আবদুল্লাহ",
    "description": "রামাদানে আমাদের আগের রুটিন এলােমেলাে হয়ে যায়। তাই আগেভাগে রামাদানের পরিবর্তিত শিডিউল অনুযায়ী নতুন রুটিন করে রাখলে রামাদান মাসকে আরাে প্রােডাক্টিভভাবে আমল করে কাটানাে সম্ভব হবে।",
    "schedule": [
      {
        "task": "সাহরির জন্য উঠুন",
        "details": "যদি এসময় খেতে আপনার ভালাে না লাগে, তাও উঠে পড়ুন। অল্প কিছু হলেও খেয়ে নিন বা পান করুন, যাতে প্রতি রাতে সাহরীর সুন্নাহ পালন করার প্রতিদান আপনি পেয়ে যান।",
        "reference": "[বুখারি, হাদিস-ক্রম: ১৯২৩; মুসলিম, হাদিস-ক্রম : ১০৯৫]"
      },
      {
        "task": "নফল সালাত আদায়",
        "details": "এই সময় চেষ্টা করুন দুই রাকাত নফল সালাত আদায় করার যাতে রাতের শ্রেষ্ঠ অংশে – ‘ তিনভাগের শেষ ভাগে আপনি সালাত আদায়ের আর দুআ করার সাওয়াব অর্জন করতে পারেন।",
        "reference": "[সূরা আলি ইমরান, আয়াত-ক্ৰম; ১৭]"
      },
      {
        "task": "ফজর ও ইশার সালাত জামাতে আদায়",
        "details": "নিশ্চিত করে নিন যে কমপক্ষে ফজর আর ইশার সালাত আপনি মসজিদে জামাতের সাথে আদায় করছেন।",
        "reference": "[মুসলিম, হাদিস-ক্ৰম : ৬৫৬]"
      },
      {
        "task": "সকাল ও বিকালের যিকর",
        "details": "নিশ্চিত করুন যাতে ফজরের সালাতের পর সকালের যিকর আর আসরের সালাতের পর বিকালের যিকর মিস না যায়।"
      },
      {
        "task": "সালাতুদ দুহা আদায়",
        "details": "যেদিন কোন কাজের তাড়া নেই, সেদিন চেষ্টা করুন ফজরের সালাতের পর সূর্য না ওঠা পর্যন্ত মসজিদে বসে থাকার এবং তিলাওয়াত ও যিকরে মশগুল থাকার।",
        "reference": "[তিরমিযি, হাদিস-ক্রম : ৫৮৬]"
      },
      {
        "task": "হালাল উপার্জনের নিয়ত",
        "details": "প্রতিদিন কাজে বেরুবার আগে নিয়ত করুন যে, সময়গুলাে আপনি কাজে লাগাবেন আল্লাহর রাস্তায় ব্যয় করার জন্য হালাল সম্পদ উপার্জনে।"
      },
      {
        "task": "কুরআন তিলাওয়াত",
        "details": "ঘরে ফিরে এসে একটু বিশ্রাম নেবার পর একটা ঘণ্টা আল্লাহর কালাম তিলাওয়াতে বা এর অর্থ নিয়ে পড়াশােনায় উৎসর্গ করুন।"
      },
      {
        "task": "ইফতারের আগের দুআ",
        "details": "ইফতারের আগের আধাঘণ্টা কাটান একনিষ্ঠ দুআর মধ্যে।",
        "reference": "[মুসনাদু আহমাদ, হাদিস-ক্রম : ৭৪৫০]"
      },
      {
        "task": "তারাবিহ সালাত",
        "details": "একদিনও যাতে তারাবিহ সালাত মিস না হয়, সেটা নিশ্চিত করুন।"
      },
      {
        "task": "প্রতিদিন সাদাকাহ করুন",
        "details": "এজন্য আপনার জন্য সহজ, এমন একটি পরিমাণ ঠিক করে নিন।"
      },
      {
        "task": "সাপ্তাহিক ইলমি হালাক্কায় অংশগ্রহণ",
        "details": "প্রতি সপ্তাহে কমপক্ষে একটা ইলমি হালাক্কায় অংশগ্রহণের টার্গেট নির্ধারণ করে নিন।"
      },
      {
        "task": "আত্মীয়দের সাথে যোগাযোগ",
        "details": "প্রতিদিন একজন আত্মীয়কে দাওয়াত দেওয়া বা তার বাসায় যাওয়ার টার্গেট সেট করুন।",
        "reference": "[মুসনাদু আহমাদ, হাদিস-ম:১২১৩]"
      }
    ]
  }
  